----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/erin/Desktop/API 6319 Chen Huang (Core).log
  log type:  text
 opened on:   2 Nov 2020, 04:03:21

. tab Immigrant_Status [aw=wght_per]

 RECODE of brthregc |
 (Country or region |
    of birth of the |
        respondent) |      Freq.     Percent        Cum.
--------------------+-----------------------------------
     Born in Canada | 8,422.3544       77.63       77.63
Born outside Canada | 2,427.6456       22.37      100.00
--------------------+-----------------------------------
              Total |     10,850      100.00

. tab ehg_all if Immigrant_Status==1 [aw=wght_per]

             Education - Highest degree |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
Less than high school diploma or its eq | 451.707602        6.70        6.70
High school diploma or a high school eq | 1,778.5045       26.39       33.09
           Trade certificate or diploma | 691.301522       10.26       43.35
College/CEGEP/other non-university cert | 1,640.4734       24.34       67.70
University certificate or diploma below | 238.754147        3.54       71.24
Bachelor's degree (e.g. B.A., B.Sc., LL | 1,329.4324       19.73       90.97
University certificate, diploma, degree | 608.826401        9.03      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,739      100.00

. tab ehg_all if Immigrant_Status==2 [aw=wght_per]

             Education - Highest degree |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
Less than high school diploma or its eq | 183.043959        4.48        4.48
High school diploma or a high school eq | 681.103304       16.67       21.15
           Trade certificate or diploma | 237.884875        5.82       26.98
College/CEGEP/other non-university cert | 872.332852       21.35       48.33
University certificate or diploma below |147.4794234        3.61       51.94
Bachelor's degree (e.g. B.A., B.Sc., LL | 1,220.7726       29.88       81.83
University certificate, diploma, degree | 742.382941       18.17      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,085      100.00

. tab years_of_residency ehg_all [aw=wght_per],row nofreq

 RECODE of |
    yrarri |
 (Range of |
years when |
respondent |
first came |                          Education - Highest degree
to Canada) | Less than  High scho  Trade cer  College/C  Universit  Bachelor'  Universit |     Total
-----------+-----------------------------------------------------------------------------+----------
  pre 1974 |      9.45      21.69       8.84      21.94       3.81      21.24      13.03 |    100.00 
 1975-1989 |      4.28      16.24       5.62      30.56       3.66      26.17      13.47 |    100.00 
 1990-1999 |      3.84      18.42       6.32      24.60       2.71      28.38      15.74 |    100.00 
 2000-2004 |      1.73      12.44       3.29      15.48       5.04      36.24      25.78 |    100.00 
 2005-2009 |      3.63      15.70       6.62      10.43       3.59      35.54      24.48 |    100.00 
 2010-2013 |      5.42       6.08       2.56      20.87       2.87      42.02      20.18 |    100.00 
-----------+-----------------------------------------------------------------------------+----------
     Total |      4.47      16.42       5.93      21.53       3.61      29.93      18.11 |    100.00 

. ttest hourly_wage, by(Immigrant_Status)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Born in |   6,747    31.16644    1.490372    122.4194    28.24484    34.08804
Born out |   4,103    26.69967    .6058668    38.80859    25.51185     27.8875
---------+--------------------------------------------------------------------
combined |  10,850     29.4773     .954875    99.46297    27.60557    31.34903
---------+--------------------------------------------------------------------
    diff |            4.466763    1.968735                .6076834    8.325842
------------------------------------------------------------------------------
    diff = mean(Born in) - mean(Born out)                         t =   2.2688
Ho: diff = 0                                     degrees of freedom =    10848

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9884         Pr(|T| > |t|) = 0.0233          Pr(T > t) = 0.0116

. do "/var/folders/wy/xvx8nz4x6131jc0qcr5cs2fw0000gn/T//SD05611.000000"

. reg lnhwage years_of_schooling if Immigrant_Status==1

      Source |       SS           df       MS      Number of obs   =     6,701
-------------+----------------------------------   F(1, 6699)      =    734.01
       Model |  268.660439         1  268.660439   Prob > F        =    0.0000
    Residual |  2451.94368     6,699  .366016373   R-squared       =    0.0988
-------------+----------------------------------   Adj R-squared   =    0.0986
       Total |  2720.60412     6,700  .406060317   Root MSE        =    .60499

------------------------------------------------------------------------------------
           lnhwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
years_of_schooling |   .0866531   .0031984    27.09   0.000     .0803832    .0929229
             _cons |   2.008384   .0439585    45.69   0.000     1.922211    2.094557
------------------------------------------------------------------------------------

. reg lnhwage years_of_schooling if Immigrant_Status==2

      Source |       SS           df       MS      Number of obs   =     4,048
-------------+----------------------------------   F(1, 4046)      =    452.34
       Model |  168.951196         1  168.951196   Prob > F        =    0.0000
    Residual |  1511.20104     4,046  .373504952   R-squared       =    0.1006
-------------+----------------------------------   Adj R-squared   =    0.1003
       Total |  1680.15223     4,047  .415159929   Root MSE        =    .61115

------------------------------------------------------------------------------------
           lnhwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
years_of_schooling |   .0844151   .0039691    21.27   0.000     .0766335    .0921966
             _cons |   1.868336   .0579964    32.21   0.000     1.754631    1.982041
------------------------------------------------------------------------------------

. reg lnhwage years_of_schooling if years_of_residency==1

      Source |       SS           df       MS      Number of obs   =       364
-------------+----------------------------------   F(1, 362)       =     31.73
       Model |  12.4181886         1  12.4181886   Prob > F        =    0.0000
    Residual |  141.665552       362  .391341304   R-squared       =    0.0806
-------------+----------------------------------   Adj R-squared   =    0.0781
       Total |  154.083741       363  .424473115   Root MSE        =    .62557

------------------------------------------------------------------------------------
           lnhwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
years_of_schooling |   .0716049   .0127114     5.63   0.000     .0466076    .0966023
             _cons |   2.396817   .1808857    13.25   0.000     2.041098    2.752536
------------------------------------------------------------------------------------

. reg lnhwage years_of_schooling if years_of_residency==2

      Source |       SS           df       MS      Number of obs   =       967
-------------+----------------------------------   F(1, 965)       =     90.80
       Model |  26.1309673         1  26.1309673   Prob > F        =    0.0000
    Residual |  277.709628       965  .287781998   R-squared       =    0.0860
-------------+----------------------------------   Adj R-squared   =    0.0851
       Total |  303.840596       966  .314534778   Root MSE        =    .53645

------------------------------------------------------------------------------------
           lnhwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
years_of_schooling |   .0702761    .007375     9.53   0.000     .0558032     .084749
             _cons |   2.237164   .1055238    21.20   0.000     2.030081    2.444247
------------------------------------------------------------------------------------

. reg lnhwage years_of_schooling if years_of_residency==3

      Source |       SS           df       MS      Number of obs   =     1,077
-------------+----------------------------------   F(1, 1075)      =    149.12
       Model |  49.4611389         1  49.4611389   Prob > F        =    0.0000
    Residual |  356.553957     1,075    .3316781   R-squared       =    0.1218
-------------+----------------------------------   Adj R-squared   =    0.1210
       Total |  406.015096     1,076   .37733745   Root MSE        =    .57592

------------------------------------------------------------------------------------
           lnhwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
years_of_schooling |   .0903264   .0073968    12.21   0.000     .0758127    .1048401
             _cons |   1.773958   .1068055    16.61   0.000     1.564388    1.983529
------------------------------------------------------------------------------------

. reg lnhwage years_of_schooling if years_of_residency==4

      Source |       SS           df       MS      Number of obs   =       681
-------------+----------------------------------   F(1, 679)       =    123.15
       Model |  44.5785972         1  44.5785972   Prob > F        =    0.0000
    Residual |  245.787972       679  .361985231   R-squared       =    0.1535
-------------+----------------------------------   Adj R-squared   =    0.1523
       Total |  290.366569       680   .42700966   Root MSE        =    .60165

------------------------------------------------------------------------------------
           lnhwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
years_of_schooling |   .1065568    .009602    11.10   0.000     .0877035      .12541
             _cons |   1.469328   .1447226    10.15   0.000      1.18517    1.753486
------------------------------------------------------------------------------------

. reg lnhwage years_of_schooling if years_of_residency==5

      Source |       SS           df       MS      Number of obs   =       762
-------------+----------------------------------   F(1, 760)       =    168.06
       Model |  58.5369378         1  58.5369378   Prob > F        =    0.0000
    Residual |  264.710145       760  .348302822   R-squared       =    0.1811
-------------+----------------------------------   Adj R-squared   =    0.1800
       Total |  323.247083       761  .424766206   Root MSE        =    .59017

------------------------------------------------------------------------------------
           lnhwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
years_of_schooling |   .1152726   .0088918    12.96   0.000     .0978172     .132728
             _cons |   1.199935   .1325224     9.05   0.000     .9397818    1.460089
------------------------------------------------------------------------------------

. reg lnhwage years_of_schooling if years_of_residency==6

      Source |       SS           df       MS      Number of obs   =       187
-------------+----------------------------------   F(1, 185)       =     42.93
       Model |  17.2456925         1  17.2456925   Prob > F        =    0.0000
    Residual |  74.3116236       185  .401684452   R-squared       =    0.1884
-------------+----------------------------------   Adj R-squared   =    0.1840
       Total |   91.557316       186  .492243635   Root MSE        =    .63379

------------------------------------------------------------------------------------
           lnhwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
years_of_schooling |   .1232028   .0188028     6.55   0.000     .0861073    .1602983
             _cons |   .9114074   .2809642     3.24   0.001     .3571016    1.465713
------------------------------------------------------------------------------------

. reg lnhwage years_of_schooling if brthregc==4

      Source |       SS           df       MS      Number of obs   =     1,329
-------------+----------------------------------   F(1, 1327)      =    113.82
       Model |  41.3787487         1  41.3787487   Prob > F        =    0.0000
    Residual |  482.425903     1,327  .363546272   R-squared       =    0.0790
-------------+----------------------------------   Adj R-squared   =    0.0783
       Total |  523.804652     1,328  .394431214   Root MSE        =    .60295

------------------------------------------------------------------------------------
           lnhwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
years_of_schooling |   .0723802   .0067844    10.67   0.000     .0590709    .0856895
             _cons |   2.167964   .0991779    21.86   0.000     1.973401    2.362526
------------------------------------------------------------------------------------

. reg lnhwage years_of_schooling if brthregc==5

      Source |       SS           df       MS      Number of obs   =     2,711
-------------+----------------------------------   F(1, 2709)      =    349.57
       Model |  128.173204         1  128.173204   Prob > F        =    0.0000
    Residual |  993.276846     2,709   .36665812   R-squared       =    0.1143
-------------+----------------------------------   Adj R-squared   =    0.1140
       Total |  1121.45005     2,710  .413819207   Root MSE        =    .60552

------------------------------------------------------------------------------------
           lnhwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
years_of_schooling |    .090169   .0048227    18.70   0.000     .0807124    .0996255
             _cons |   1.722923   .0704499    24.46   0.000     1.584782    1.861064
------------------------------------------------------------------------------------

. 
end of do-file

. log close
      name:  <unnamed>
       log:  /Users/erin/Desktop/API 6319 Chen Huang (Core).log
  log type:  text
 closed on:   2 Nov 2020, 04:04:14
-----------------------------------------------------------------------------------------------------------------------
